---
type: StructuralSectionGeneralH
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 5
tags: [revit-api, class]
---

# StructuralSectionGeneralH

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralH | 2018 | `public StructuralSectionGeneralH ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double outerFillet , double centroidHorizontal , double centroidVertical ,` |
| Property | InnerFillet | 2018 | `public double InnerFillet { get ; set ; }` |
| Property | OuterFillet | 2018 | `public double OuterFillet { get ; set ; }` |
| Property | WallDesignThickness | 2018 | `public double WallDesignThickness { get ; set ; }` |
| Property | WallNominalThickness | 2018 | `public double WallNominalThickness { get ; set ; }` |